data/2023-04/benchmark-caddy-2023-04.txt
Running 1m test @ http://localhost:8787
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.62ms   10.47ms 138.10ms   88.21%
    Req/Sec     5.52k     1.01k   11.36k    71.47%
  Latency Distribution
     50%    4.07ms
     75%    9.90ms
     90%   20.07ms
     99%   49.62ms
  1318201 requests in 1.00m, 0.93GB read
Requests/sec:  21933.75
Transfer/sec:     15.77MB