data/2023-04/benchmark-sws-2023-04.txt
Running 1m test @ http://localhost:8787
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.26ms    0.93ms  24.92ms   72.72%
    Req/Sec    11.12k   644.88    16.28k    83.54%
  Latency Distribution
     50%    2.21ms
     75%    2.78ms
     90%    3.38ms
     99%    4.80ms
  2656557 requests in 1.00m, 1.90GB read
Requests/sec:  44239.13
Transfer/sec:     32.36MB